[
  {
    "job_title": "Software Developer",
    "company": "TREND MICRO INCORPORATED-PHILIPPINE BRANCH",
    "location": "National Capital Reg",
    "salary": null,
    "Prog_scripting_markup_languages": ["Python"],
    "databases": [],
    "frameworks_web_dev": [],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [],
    "other_tools": ["Object-Oriented Programming"],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": ["Agile", "DevOps"],
    "cloud_platforms": ["AWS"],
    "version_control_platforms": ["AWS"],
    "date_posted": "25-11-2022 16:17:09",
    "career_level": "0-1 yr",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": "4 years",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/software-developer-12548939?jobId=jobstreet-ph-job-12548939&sectionRank=1&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "Tests and deploys computer software used in day-to-day operation and works closely with service engineering teams to ensure platform is built with scalability, security, and ease of maintenance. Duties and Responsibilities: • Designs and develops computer software solutions to support backend services using Python • Applies technical skills in processing and analyzing computer binary files • Applies principles and techniques of Object-Oriented Programming working on Agile DevOps Methodologies • Accomplishes testing and deployment of computer software used in day-to-day operations • Ensures that services are delivered effectively and efficiently • Meets business objectives and team targets defined by Service Level Objectives • Manages service incidents or problems and enhances end-to-end processes • S/he will also be assigned to do project management or employee-driven initiatives that will address concerns on increasing productivity, efficiency, and delivering operational excellence We’re a global cybersecurity leader, helping to make the world safe for exchanging digital information. Fueled by decades of security expertise, global threat research, and continuous innovation, our cybersecurity platform protects hundreds of thousands of organizations and millions of individuals across clouds, networks, devices, and endpoints. As a leader in cloud and enterprise cybersecurity, our platform delivers a powerful range of advanced threat defense techniques optimized for environments like AWS, Microsoft, and Google, and central visibility for better, faster detection and response. Our global threat research team delivers unparalleled intelligence and insights that power our cybersecurity platform and help protect organizations around the world from 100s of millions of threats daily. We have 7,000 employees across 65 countries, singularly focused on security and passionate about making the world a safer and better place. We enable organizations to simplify and secure their connected world. Trend Micro’s “Trenders” are passionate about doing the right thing to make the world a safer and better place."
  },
  {
    "job_title": "IT and Software Developer",
    "company": "T&G Corporation",
    "location": "National Capital Reg",
    "salary": "₱25,000 - ₱50,000",
    "Prog_scripting_markup_languages": ["JavaScript", "CSS", "LISP"],
    "databases": [],
    "frameworks_web_dev": ["jQuery", "Bootstrap"],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [".NET"],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "22-11-2022 00:00:00",
    "career_level": "1-4 yrs",
    "qualification": "Bachelor's/College Degree Post Graduate Diploma/Master's Degree Professional License (Passed Board/Bar/Professional License Exam)",
    "years_of_experience": "3 years",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/it-and-software-developer-12538450?jobId=jobstreet-ph-job-12538450&sectionRank=3&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "We are seeking IT and Software Developers, working remotely to join our Technical Services team based in the Philippines. They will develop, support, and maintain various internal applications and associated infrastructure services across the IT group. Alongside technical prowess, we particularly look for individuals with a “can-do” attitude, a willingness to jump in and help with any problems, always looking for new ways to solve problems, and continued evaluation of work, process, and output to ensure great products get out in the best possible way. ESSENTIAL DUTIES AND RESPONSIBILITIES The main duties of this position will include (but are not limited to): Support and maintain our internally developed IT system Working across regional boundaries with external technical groups and peers to ensure product quality, stability, and a determination to professionally manage and resolve potentially complex issues on a variety of different platforms and applications. Address problems reported by clients (internal/external) on software defects Providing Software upgrades, installation, and general help desk support. This may include Patching and Hot Fix deployment including fault finding, testing, and rollbacks. Provide detailed analysis of Service Desk items relating to Application Support, including first and second-level follow-up of identified issues. Assist with other technical services projects as required Draft, proofread, and edit creative and technical materials across different media platforms; Other necessary works if needed. QUALIFICATIONS AND SKILLS Bachelor’s Degree in Computer Science, Information Technology, Engineering, or any related field Knowledge in CAD software and programming Auto LISP, AutoCAD, ProSteel is highly desirable Analytical thinking, fault finding & problem-solving skills are a must as is a solid background in Web Technologies such as HTML5, Bootstrap CSS, REST API, JQuery, JavaScript, and JSON. Familiar with UI/UX and illustrator tools such as MIRO, Adobe Photoshop & Illustrator, or any graphic design software alike. Familiar with Bootstrap, CSS Basic knowledge and understanding of any back-end system Using Nodes, .Net Framework, etc. Strong software development methodology knowledge. Fresh graduates are encouraged to apply. PERSONAL ATTRIBUTES Resourcefulness and troubleshooting aptitude Strong English written and verbal communication skills Diligent attention to detail Constructive decision-making skills and excellent problem-solving skills Willing to learn and explore new skill sets. T&G Corporation is an industry-focused team, composed of innovative and diverse comprising engineers and designers professionals who customize and deliver large-scale mining projects from concept to operation using our technically advanced, state-of-the-art ONE-STOP-SHOP business model. T&G Corporation team holds a deep respect for every one of our clients, employees, business partners. We apply strong business integrity to every project on which we work and we always strive to give clients the best value service.     ."
  },
  {
    "job_title": "Software Developer",
    "company": "Marie France Bodyline International, Inc.",
    "location": "Makati City",
    "salary": null,
    "Prog_scripting_markup_languages": ["SQL", "PHP"],
    "databases": ["MySQL"],
    "frameworks_web_dev": ["Laravel", "jQuery", "Bootstrap"],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "25-11-2022 16:17:14",
    "career_level": "0-1 yr",
    "qualification": "Not Specified",
    "years_of_experience": "4 years",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/software-developer-12596047?jobId=jobstreet-ph-job-12596047&sectionRank=6&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "Responsibilities: Build custom applications. Develop and maintains specific databases, data dictionaries, and systems for electronic data entry, cleaning, and data management. Design, test, and write codes for functionality, ease of use, efficiency, and accuracy for the different systems used by the company Prepare technical documentation of product components Conduct unit testing and integration testing for functionality and limits Recommends changes to support best practices, adherence to performance requirements, and easy maintainability Ensures that network software and subsystems are maintained at a current and optimum performance level. Analyzes network computer and software reliability and utilization reports to identify and correct problem areas and to establish computer performance levels. Recommends or performs minor remedial actions to correct problems. Provides updates, status, and completion report to IT Manager Skills & Qualifications Requirements: Graduate of any IT related course 4 or more years of programming experience. Experience with development life cycle with the support of SQL scripting and tuning during the development cycle. Strong quantitative and technical skills. Knowledge of database optimization, data architecture, and design techniques (UI/UX). Working experience in: Jquery UI / Plugins, Bootstrap, Javascript/Ajax, Code Igniter, CSS3, HTML5, TcPDF, PHP, Laravel, MySQL, MS SQL, Visual Basic Experience in Power BI and other Business Intelligence Tools is an advantage. Trailblazer. Leader. Game-changer. Now clocking four decades of proven expertise, the Marie France Group of Companies remains the leading provider of innovative slimming, skin care, and hair & scalp care solutions in the Philippines. Under the group’s umbrella are three of the most trusted names in the country: Marie France, Facial Care Centre, and Svenson. Svenson started its operations in 1981 and was the first to offer technologically advanced non-invasive hair loss treatments. It has a complete range of solutions to cover all stages of hair loss. Whether a client needs scalp corrective therapies, or anti-hair loss treatments, or a hair transplant, or the most advanced hair replacement systems, Svenson has tried-and-tested solutions for all. Facial Care Centre followed in 1983, quickly setting itself apart from other skin care centers by exclusively offering premium non-invasive anti-aging and skin rejuvenating treatments. Using only the best practices and techniques, Facial Care is dedicated to giving clients visible, transformative results – naturally and beautifully. And finally in 1985, Marie France was established, completely revolutionizing the Filipinos’ perspective on slimming, health and wellness. It trailblazed a scientific approach to weight loss with a focus on nutrition and overall health, introducing many non-surgical slimming breakthroughs, including the cold wrap Fat Mobilization System (FMS), cryolipolysis, laser lipo, and functional magnetic stimulation. Currently with 28 branches in 12 locations all over Metro Manila, Pampanga and Cebu, more branch expansions nationwide are on the horizon. With our clients at the heart of everything we do, the Marie France group is all about beauty solutions that rebuild, restore and transform."
  },
  {
    "job_title": "Software Developer (Fresh Graduate)",
    "company": "TREND MICRO INCORPORATED-PHILIPPINE BRANCH",
    "location": "National Capital Reg",
    "salary": null,
    "Prog_scripting_markup_languages": [],
    "databases": [],
    "frameworks_web_dev": [],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": ["Windows"],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": ["Agile"],
    "cloud_platforms": ["AWS"],
    "version_control_platforms": ["AWS"],
    "date_posted": "23-11-2022 00:00:00",
    "career_level": "0-1 yr",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": null,
    "job_specializations": "Computer/Information Technology",
    "link": "https://www.jobstreet.com.ph/en/job/software-developer-fresh-graduate-12544352?jobId=jobstreet-ph-job-12544352&sectionRank=2&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "Our mission is to create cloud based products to secure enterprise environment. At current, we are looking for smart and enthusiastic individuals to join our team as Software Developers. If you think you have the passion to write codes and have the interest in dealing with challenging problems, and you want to be part of a team that pilots new technologies, join us! What you'll do Develop applications for threat analysis and response. Effectively leverage latest cloud technologies and practices in solution development. Deliver solutions with built-in quality. Apply secure coding practices in designing and developing applications. Provide on-going maintenance, enhancement and support for existing systems and platforms. Collaborate closely with threat experts and continuously build up security domain knowledge. Effectively adapt agile mindset and practice in teamwork. Continuously improve the way of work and provide recommendations. What you'll need Bachelor’s degree in Computer Science, Information Technology or related fields Keen interest and familiarity in Software Development and languages Knowledge in Windows or Linux administration, networking, web server administration and virtualization. Knowledge in design and developing AWS/Azure public cloud service is a big plus We’re a global cybersecurity leader, helping to make the world safe for exchanging digital information. Fueled by decades of security expertise, global threat research, and continuous innovation, our cybersecurity platform protects hundreds of thousands of organizations and millions of individuals across clouds, networks, devices, and endpoints. As a leader in cloud and enterprise cybersecurity, our platform delivers a powerful range of advanced threat defense techniques optimized for environments like AWS, Microsoft, and Google, and central visibility for better, faster detection and response. Our global threat research team delivers unparalleled intelligence and insights that power our cybersecurity platform and help protect organizations around the world from 100s of millions of threats daily. We have 7,000 employees across 65 countries, singularly focused on security and passionate about making the world a safer and better place. We enable organizations to simplify and secure their connected world. Trend Micro’s “Trenders” are passionate about doing the right thing to make the world a safer and better place."
  },
  {
    "job_title": "Software Developer",
    "company": "Seansoft Corporation",
    "location": "National Capital Reg",
    "salary": "₱30,000 - ₱60,000",
    "Prog_scripting_markup_languages": ["JavaScript", "HTML", "CSS", "SQL"],
    "databases": [],
    "frameworks_web_dev": ["React"],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "23-11-2022 00:00:00",
    "career_level": "1-4 yrs",
    "qualification": "High School Diploma",
    "years_of_experience": "1 year",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/software-developer-12542416?jobId=jobstreet-ph-job-12542416&sectionRank=7&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "We are looking for software developers who want to join our team as remote workers. We are distributed across the Philippines, collaborating online for the work day, avoiding all of the traffic. We have multiple immediate openings for capable software engineers who want to grow and expand their experience Experience with browser based technologies: HTML, JavaScript, CSS (Less or SaSS) with special emphasis on React or AngularJS. Server side skills Node.js or Python/Django and SQL are a plus. We value your ability to demonstrate your capability with any of the above skills more than work experience. Self starters, self taught people are welcome to apply. Come and show us what you can do! Seansoft Corporation is a custom software development firm specializing in Node.js and front end technologies. We work in a number of back end server languages and frameworks in addition to our work with Node. With over a decade of international business behind us we are looking to continue our reach with your help. Please contact us for a technical interview today!"
  },
  {
    "job_title": "Software Developer (.Net) (Mid-Senior) | Hybrid (Once-twice/week) | Dayshift | BGC, Taguig | Direct Hire",
    "company": "Nezda Technologies, Inc.",
    "location": "Taguig City",
    "salary": null,
    "Prog_scripting_markup_languages": ["SQL", "C#"],
    "databases": [],
    "frameworks_web_dev": ["Angular", "React"],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [".NET"],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": ["Agile"],
    "cloud_platforms": ["AWS"],
    "version_control_platforms": ["Azure", "AWS"],
    "date_posted": "25-11-2022 06:17:17",
    "career_level": "1-4 yrs",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": "3 years",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/software-developer-.net-mid-senior-%7C-hybrid-once-twice-week-%7C-dayshift-%7C-bgc-taguig-%7C-direct-hire-12549325?jobId=jobstreet-ph-job-12549325&sectionRank=9&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "Duties and Responsibilities: Build expertise on assigned functionalities Build expertise on relevant technologies Follow workload prioritization and provide status updates Analyze requirements. Propose solution, code and automate testing of solutions Resolve production issues Offer flexibility to meet sprint goals Qualifications: BS in Computer Science/Mathematics/Physics/Data Science or equivalent experience 3-7+ years of professional programming experience in C#, .NET and SQL is a must. Knowledge in API integration and implementation or Unit tests 1+ years recognized as a subject matter expert of enterprise-level systems or sub-systems, working on coding, design and production support 1+ years of experience working in an agile setting Good to have: Test automation experience using xUnit, NUnit or other C# test automation framework Experience with implementing cloud deployed solutions (Azure preferred, AWS considered) Web development experience with Angular or React Hands-on experience working within microservice based architecture External API design / implementation experience Cloud data storage experience (Azure SQL, Cosmos or equivalents) Experience working with CI/CD automation Test automation development experience beyond unit testing (integration, performance, etc)\" Work Schedule : Dayshift (Flexible schedule) Core hours: 10am-4pm Work Location: BGC, Taguig (Hybrid (once-twice/week) Benefits: HMO, Insurance and allowance Nezda - Established in 2014 with 2 offices world-wide, 200+ global clients and strategic workforce is now emerging as Philippines’s most promising people supply chain company with multiple offices and 300+ core employees. The company started with IT Temporary staffing and now expanded its portfolio to now become the one stop solution for staffing & HR services by offering the following services:-Temporary staffing, Permanent Recruitment, Payroll processing, and Learning Services."
  },
  {
    "job_title": "Software Developer",
    "company": "MegaXcess IT Solutions Inc.",
    "location": "Pasig City",
    "salary": "₱35,000 - ₱60,000",
    "Prog_scripting_markup_languages": ["JavaScript", "Python"],
    "databases": [],
    "frameworks_web_dev": ["Django", "Angular", "Flask", "React"],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "20-11-2022 00:00:00",
    "career_level": "1-4 yrs",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": "3 years",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/software-developer-12557546?jobId=jobstreet-ph-job-12557546&sectionRank=4&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "Duties & Responsibilities 1. Research, design, develops, and test new application based on the system requirements. 2.  Evaluate and identify new technologies for implementation. 3.  Maintaining the system by monitoring, identifying, and correcting software defects. 4. Professionally maintain all software and create updates regularly to address customer and company concerns. 5. Troubleshoot coding problems quickly and efficiently to ensure a productive workplace. Job Competencies 1.   Experience in software platforms across multiple organizational units 2.   Experience with Web Applications and programming languages such as HTML5/6, CSS3, JavaScript, and Python 3.   Functional knowledge of Web Services (REST, SOAP, etc.) is needed 4.   Experience with responsive development is desired. 5.   Frameworks: React, Angular, Node.js, Django, Flask, or Pyramid 6.   Knowledge of ORM (Object Relational Mapper) 7.   Capable of writing and understanding complex queries. Job specification 1. Must possess at least a bachelor’s degree in Computer Science/Information Technology, Engineering (Computer/Telecommunication) or it’s equivalent. 2.  2-3 years of experience developing and implementing software applications. 3.     Outstanding collaboration and communication skills are essential. 4.     Good problem-solving skills. The online gaming sector has grown exponentially in recent years and is expected to keep growing. This growth generated extensive online betting and transactions which give rise to the proliferation of more independent operators. The demand for such service by PAGCOR prompted to outsource a third-party auditor to provide PAGCOR a modular yet centralized system to manage gaming license holders, outlets, terminals, cashiers, operations, and players. The introduction of automated auditing is an impeccable chance for MegaXcess IT Solutions, Inc and PAGCOR to cater the needs of our local e-gaming operators and licensees. This system will allow PAGCOR to have an intermediation platform to conduct real time audit for any gaming licensee at any time. Payment solutions are integrated into the system so that PAGCOR will be able to make precise collections of the required fees, penalties and revenues from outlet operators based on accurate system generated audit reports. We aim to provide necessary support essential for the growth of the Licensee and the Philippine gaming industry. With our state-of-the-art technology, MegaXcess aims to integrate an automated auditing system to ensure transparency from the operators to PAGCOR, and everything in between. Our goal is to help the gaming industry through efficient and transparent auditing that will increase the PAGCOR’s gaming revenue. The government can highly benefit from growing industry and use its revenue to help develop the country. If done correctly, the Philippines will become a striking investment center for other online businesses and different industries."
  },
  {
    "job_title": "Software Developer",
    "company": "Toolkit Inc.",
    "location": "National Capital Reg",
    "salary": null,
    "Prog_scripting_markup_languages": ["JavaScript", "Python"],
    "databases": ["PostgreSQL", "Oracle"],
    "frameworks_web_dev": [],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": ["Oracle", "SAP"],
    "methodologies": [],
    "cloud_platforms": ["Oracle"],
    "version_control_platforms": [],
    "date_posted": "22-11-2022 00:00:00",
    "career_level": "1-4 yrs",
    "qualification": "Not Specified",
    "years_of_experience": "2 years",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/software-developer-12585820?jobId=jobstreet-ph-job-12585820&sectionRank=10&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "Core Responsibilities Work with functional teams to analyze business requirements, design and implement business solutions Design and develop an effective and scalable integration solution for third-party systems, including eCommerce platforms, WMS, and TMS Configuration, Installation, and maintenance of servers and databases Create and maintain documentation for both business and technical details Adhere to and promote best software programming practices such as coding standards, code, and design reviews, and test coverage Troubleshoot issues and provide hands-on support to system users Requirements Strong experience in Python and/or Javascript programming language Strong Experience in relational databases and schema design Good understanding of RESTful API Ability to learn fast and execute accordingly Experience with PostgreSQL is a plus Graduating Students or Fresh Graduates are welcome to apply Undergrads who can demonstrate intermediate or advance programming skills are welcome to apply Toolkit inc was founded by a team of enthusiastic Software Developers and Accounting and Finance Consultants who wanted to overcome the routine and create a company that would act in the market not only for business success but for the sake of Technology itself. Though the founders had extensive experience in proprietary software such as Oracle, SAP and Microsoft, they decided to focus exclusively on open source technologies to provide Enterprises with alternative solutions to their costly information system. Over a short period of time our company has already developed a range of solutions and we have gained ample experience in the services we offer: Custom Software Development, E-commerce Solutions Development, Legacy Applications Reconstruction, Online Strategy (online presence, social media), IT Consultancy, Technology Assessment and Planning, Process and Workflow Improvement, Infrastructure Support, ERP Solutions and Logistics Systems. At Toolkit, we firmly believe that Information Technology should be cost effective, reliable and easy to use. We blend seasoned project managers, skilled software developers and creative web designers to produce innovative solutions that are designed for ease-of-use, engineered for durability and built with your priorities in mind."
  },
  {
    "job_title": "Junior Software Developer / Programmer",
    "company": "StairBiz Software Pty Ltd",
    "location": "Makati City",
    "salary": "₱25,000 - ₱35,000",
    "Prog_scripting_markup_languages": ["JavaScript"],
    "databases": [],
    "frameworks_web_dev": ["Angular", "Bootstrap"],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [".NET"],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": ["Windows"],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "25-11-2022 00:17:18",
    "career_level": "0-1 yr",
    "qualification": "Not Specified",
    "years_of_experience": null,
    "job_specializations": "Computer/Information Technology",
    "link": "https://www.jobstreet.com.ph/en/job/junior-software-developer-programmer-12593657?jobId=jobstreet-ph-job-12593657&sectionRank=5&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "You will be part of the development team for the StairBiz Program, an integrated staircase manufacturing software package including design, specification, estimation, quotation, inventory, CNC, 3D, client management, project management and scheduling. This program has been a much-loved application suite for many years, with proven success in our very niche market. Job Highlights: ·        Excellent remuneration to reflect your value ·        Flexibility (including some WFH) if you need it ·        A relaxed, casual environment. What you will be part of: To stay ahead we have been migrating and updating the legacy program to a new Angular and .NET cloud platform, and this cutting-edge work is now complete and is currently in soft release. Working in our Makati-based dev team, you will be key to new development and maintenance into the future. There will also be a graphic design and page layout component to your contribution. You will become a significant and valued member of the team. Required Qualifications and Skills: ·        Bachelor’s Degree in Computer Science/Information Technology or equivalent ·        Fresh graduate or up to 1 year work experience ·        A good eye for graphic design and page layout ·        Front-end development - JavaScript, HTML5/CSS, Bootstrap ·        C#.NET ·        SQL Good to Have: ·        VSTS/Git ·        Angular/Typescript Also Important: ·        Creative and energetic ·        Keen to contribute Why join us? ·        We are an equal opportunities employer ·        You will have awesome co-workers - we wrote this ad ;-) ·        Free donuts every Wednesday ;-) ·        Hours are somewhat flexible - most of us choose to work 7am to 4pm ·        Work from home most (but not all) Mondays and Fridays, if you like. ·        Casual dress in a casual environment – there is a nice dynamic in the office. ·        We enjoy a large open-plan office with large windows, large desks, and indoor plants everywhere you look. We have our own bathroom. ·        You can look forward to a long, enjoyable and personally rewarding career. ·        Your pay will reflect your competence, rather than some nominal pay schedule. ·        You will find us respectful and easy to work with - there is no office politics. ·        We are a growing company with a global reach. ·        The Managing Director joins us from Australia from time to time but mostly keeps out of our hair. About Us: We are a small software development company, specializing in computer software for the timber staircase manufacturing industry. We have been in business over 20 years. We are based in Australia, with clients in Australasia, Europe and USA. Our Product: Our product is the StairBiz Program, an expert-level, specialized, integrated suite of design, manufacturing and management tools. It includes design (CAD), specification, estimation, quotation, inventory, accounts, CNC (CAM), 3D, job tracking, client management, project management and scheduling. Our Clients: Our clients are exclusively staircase manufacturing companies, i.e. organizations who specialize in the design, manufacture and installation of staircases and balustrades made from timber, steel and glass. After our clients purchase our software we maintain that software and support those users."
  },
  {
    "job_title": "Software Developer",
    "company": "FUJITSU GLOBAL DELIVERY CENTER PHILIPPINES",
    "location": "Taguig City",
    "salary": null,
    "Prog_scripting_markup_languages": ["Java", "C#"],
    "databases": ["Oracle"],
    "frameworks_web_dev": ["Spring"],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [".NET", "Spring"],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": ["Oracle"],
    "methodologies": [],
    "cloud_platforms": ["Oracle"],
    "version_control_platforms": [],
    "date_posted": "23-11-2022 00:00:00",
    "career_level": "1-4 yrs",
    "qualification": "Not Specified",
    "years_of_experience": "3 years",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/software-developer-12545279?jobId=jobstreet-ph-job-12545279&sectionRank=11&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "Ideal candidate for the role: Has completed a Bachelor's Degree in Computer Science, Computer Engineer, Information Technology, or other relevant courses Experienced in Application Development (Design, Programming, Testing) Primary Skill: Java or Java & Python/Ruby on Rails or Java & VB.Net Other technical background (Oracle, MSSQL, Spring, C#, .Net, iOS, Android, etc) is desired The Java Developer is accountable to do the following job responsiblities in order to do the job: Inputs to and suggests improvements to designs. Provides designs for medium size components. Monitors their own work, escalating problems and queries to higher levels to ensure timelines are met. Contributes towards plans for own individual work items. For routine and non-routine problems, produces high quality solutions and documentation through the use of a structured approach that may include appropriate methods, tools, and testing. Fluently presents technical information to technical audiences both orally and in writing. Communicates issues in a timely manner. Is able to listen and act on instructions given. Contributes to team meetings, peer review or deliverables, etc. Keep abreast of technology developments within their own specialism. Design systems or applications based on client's requirements. Develop programs based on design and requirements specificatons. Create test specifications and execute testing. Conduct review of technical work outputs. Fujitsu Fujitsu is the no. 1 IT company in Japan. It is one of the world's largest providers of full range technology products, solutions and services. In the Philippines, Fujitsu offers a complete one-stop-shop for ICT solutions and services from design to implementations of ICT solutions, software development, maintenance, support and shared services. WeServ Systems International, Inc. WeServ Systems International, Inc. is Fujitsu's Global Delivery Center in the Philippines. As a Fujitsu company, WeServ works as a trusted partner to Fujitsu customers, providing reliable application and technology services to support the business needs. Your future in Fujitsu In Fujitsu, we select the best Philippine IT talents and develop them as experts in world-class IT Infrastructure, Application Development, Systems and Web Administration, Service Desks Support and Client Coordination. Fujitsu built these perks and benefits just for you because at this tough time, we care for you. • HMO Benefit  and Doctor’s Teleconsult • Loyalty Long Service Award • Medical Reimbursement • Technical and Soft Skills Training • Vacation Leave • Sick Leave • Paid Maternity/Paternity Leave • Marriage Leave • National Emergency Leave • Annual Performance Bonus – (Management prerogative) • Retirement Plan Benefit • Group Life Insurance • Workplace Subsidy Allowance • Company Covid-19 Vaccination Program for employees and 4 dependents • Special Interest Group • Employee’s Wellbeing Program • Corporate Social Responsibility Activities • Leadership Program • Opportunity to Work Abroad Let us shape your world together!"
  },
  {
    "job_title": "Software Developer",
    "company": "GECO Asia Pte. Ltd",
    "location": "National Capital Reg",
    "salary": "₱35,000 - ₱65,000",
    "Prog_scripting_markup_languages": [],
    "databases": [],
    "frameworks_web_dev": [],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": ["SAP"],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "25-11-2022 06:17:20",
    "career_level": "1-4 yrs",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": null,
    "job_specializations": "Computer/Information Technology",
    "link": "https://www.jobstreet.com.ph/en/job/software-developer-12549442?jobId=jobstreet-ph-job-12549442&sectionRank=12&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "We are looking for an eager and motivated Software Developer to join our team! As a Software Developer, you will be in charge of assisting our software development team at all stages of development, testing, and implementation. Requirements and Qualifications: Minimum of a Bachelor’s Degree in Computer Science, Information Technology, or a related field. Minimum of 6 months of experience in software programming or development. Knowledge of basic programming languages. Excellent verbal and written communication skills. Strong analytical skills. Highly developed attention to detail. Ability to work well in a team environment. Duties and Responsibilities: Writing and debugging code. Troubleshooting software issues. Working closely with developers to improve the product’s functionality. Developing innovative solutions. Participating in code reviews and quality assurance activities. Participating in estimation discussions with the product team. Continually improving coding skills. At GECO Asia, we pride ourselves as one of the leading IT/SAP Consulting and Resourcing firm with access to cutting edge and niche projects. Our client base includes blue chip customers from Singapore, Malaysia, Hong Kong and Philippines. Having delivered more than 500+ SAP and Digital Transformation assignments in last 5 years, we have the trust of both quality clients and our quality consultants. Send us your interest to fast forward your career. We give you unparallel access to new projects in modern IT areas like Digital Transformation, Cloud Computing, Data Science, Machine Learning, Internet Of Things and IT Governance."
  },
  {
    "job_title": "Junior Software Developer",
    "company": "Netmarks Philippines, Inc.",
    "location": "National Capital Reg",
    "salary": null,
    "Prog_scripting_markup_languages": [],
    "databases": [],
    "frameworks_web_dev": [],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "25-11-2022 06:17:21",
    "career_level": "0-1 yr",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": null,
    "job_specializations": "Computer/Information Technology",
    "link": "https://www.jobstreet.com.ph/en/job/junior-software-developer-12549078?jobId=jobstreet-ph-job-12549078&sectionRank=13&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "Job description Generate software algorithms and execute this in the required language Create Graphical User Interfaces for software projects Perform debugging on programmed codes and software Create documentation for programs which are currently under development and those which have been developed Collect and process customer (internal and external) information which is relevant to the software project currently engaged in Provide end-user support and assistance regarding any and all software projects Perform Research and Development tasks such as information collection, organization and presentation All other tasks which may be assigned according to the departmental and/or organizational requirements Qualifications Candidate must possess at least Bachelor Degree in Computer Science/ Information Technology Strong communication skills – able to communicate clearly, effectively and in a timely manner. Excellent analytical and critical thinking skills - able to analyze and solve problems. Ability to identify and document solutions to complex business problems with accuracy. Fresh graduates welcome to apply Temporary Work from Home set up \" We envision  to be the Philippines' most valued ICT Solutions provider to the world\" Established in January 2002, Netmarks Philippines Inc. is a joint venture between Netmarks Inc. (Japan) and the Sanvictores Group. We are a growing company mainly supporting the IT Infrastructures of large multinational corporations in the Philippines."
  },
  {
    "job_title": "System Software Senior Programmer",
    "company": "TTEC Customer Care Management Phils., Inc.",
    "location": "National Capital Reg",
    "salary": "₱80,000 - ₱100,000",
    "Prog_scripting_markup_languages": [
      "JavaScript",
      "HTML",
      "CSS",
      "Python",
      "Shell",
      "Perl"
    ],
    "databases": [],
    "frameworks_web_dev": [],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [],
    "other_tools": ["Flow"],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": ["Windows"],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "24-11-2022 00:00:00",
    "career_level": "0-1 yr",
    "qualification": "Not Specified",
    "years_of_experience": "2 years",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/system-software-senior-programmer-12571170?jobId=jobstreet-ph-job-12571170&sectionRank=8&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "At TTEC Digital, we strive to create an environment where employees thrive. We coach our clients to do the same, and ensure their employees feel valued, happy and rested, because delivering amazing customer experiences is ultimately an employee first process. TTEC Digital seeks a skilled developer to work within a dynamic, customized ServiceNow CSM/ITSM instance servicing numerous clients for our Managed Services solution. The platform has hundreds of internal users and thousands of client end users. The ideal candidate will have extensive experience developing solutions to complex problems on the ServiceNow platform and expert level programming skills, along with an understanding of CSM, ITSM, configuration and asset management principles and extensive experience integrating ServiceNow with various other technologies. What You’ll be Doing Develop and troubleshoot on the ServiceNow platform (CSM, ITSM) Lead development efforts for ServiceNow system integrations. Build and maintain configuration management database within ServiceNow. Attend daily team meetings and scrum calls. Responsible for completing assigned development tasks on time. Provide expertise on technical questions related to ServiceNow. Provide Subject Matter Expert level understanding of ServiceNow. What You Bring to the Role Ideal candidate must be self-motivated with a proven track record in ITM and CSM processes and technologies. Enjoy working in a fast-paced environment with an expanding, diverse customer base. Experience developing and troubleshooting on the ServiceNow platform. Advanced experience with ServiceNow implementations. Experience working in a domain separated environment. Advanced System integration experience using web services and other web based technologies such as XML, HTML, AJAX, CSS, HTTP, REST/SOAP. Experience developing workflows via Flow Designer and Integration Hub. Experience integrating ServiceNow and ScienceLogic EM7. Strong experience in LDAP, SSO, OKTA, and multifactor authentication methods. Strong communication and writing/documentation skills. Experience with development and implementation of ServiceNow modules, including Customer Service Management, Incident Management, Problem Management, Configuration Management, Change Management, Knowledge Management, ITOM and Asset Management. Experience with Business Rules, Script Includes, UI Actions, Scheduled Jobs - all scripted aspects of the ServiceNow system Experience in one (or more) scripting languages: JavaScript, Python, Perl, Unix Shell, Windows Shell) Experience with ServiceNow client and server-side JavaScript and the ServiceNow APIs Scripted Web-Services, AJAX, Business Rules, JavaScript, SOAP, REST SSO-SAML Setup and Integration of ServiceNow to Other Applications Customizing ServiceNow using UI Pages, UI Macro & CMS using CSS, HTML, Jelly. Experience presenting and conducting demos. Our business is about making customers happy. That’s all we do. Since 1982, we’ve helped companies build engaged, pleased, profitable customer experiences powered by our combination of humanity and technology. On behalf of many of the world’s leading iconic and disruptive brands, we talk, message, text, and video chat with millions of customers every day. These exceptional customer experiences start with you. TTEC is proud to be an equal opportunity employer where all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. TTEC embraces and is committed to building a diverse and inclusive workforce that respects and empowers the culture and perspectives within our global teams. We strive to reflect the communities we serve by not only delivering amazing service and technology, but also humanity. We make it a point to make sure all our employees feel valued and comfortable being their authentic selves at work. As a global company, we know diversity is our strength. It enables us to view projects and ideas from different vantage points and allows every individual to bring value to the table in their own unique way."
  },
  {
    "job_title": "Jr. Laravel Software Developer | Las Pinas",
    "company": "Golden Haven Memorial Park, Inc.",
    "location": "National Capital Reg",
    "salary": null,
    "Prog_scripting_markup_languages": [],
    "databases": [],
    "frameworks_web_dev": ["Laravel"],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "25-11-2022 06:17:22",
    "career_level": "0-1 yr",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": null,
    "job_specializations": "Computer/Information Technology",
    "link": "https://www.jobstreet.com.ph/en/job/jr.-laravel-software-developer-%7C-las-pinas-12546949?jobId=jobstreet-ph-job-12546949&sectionRank=14&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "The Jr. Laravel Software Developer position acts as an employee champion in the organization focused on developing both client and server software thru advance programming. Responsibilities : Develops both front and back-end web applications. Designs UI/UX on web applications. Conceptualizes and advances IT projects to finished product. Designs and develops APIs (Expose and Consume). Meets and ensures technical and user needs. Keeps abreast of developments in web applications and programming languages. Performs other related tasks as determined by immediate superior. Requirements : Knowledge of the said technology/technologies. Less than 1yr programming experience. Knowledge in software development life-cycle. The desire to work in a fast-paced environment. Ability to learn new software and technologies quickly. Ability to follow instructions and work in a team environment. The largest and most beautiful chain of memorial parks in the Philippines. It is also the FIRST & ONLY death care company listed under the Philippine Stocks Exchange (HVN)."
  },
  {
    "job_title": "R0004354: Web Developer",
    "company": "TREND MICRO INCORPORATED-PHILIPPINE BRANCH",
    "location": "Pasig City",
    "salary": null,
    "Prog_scripting_markup_languages": ["JavaScript", "SQL", "C#"],
    "databases": [],
    "frameworks_web_dev": [
      "Angular",
      "jQuery",
      "ASP.NET",
      "Bootstrap",
      "Foundation"
    ],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [".NET"],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": ["AWS"],
    "version_control_platforms": ["AWS"],
    "date_posted": "25-11-2022 16:17:23",
    "career_level": "1-4 yrs",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": "2 years",
    "job_specializations": [
      "IT-Network/Sys/DB Admin",
      "Computer/Information Technology"
    ],
    "link": "https://www.jobstreet.com.ph/en/job/r0004354%3A-web-developer-12544367?jobId=jobstreet-ph-job-12544367&sectionRank=15&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "As the number of cyberattacks and digital threats continue to grow, our world needs more passionate and innovative individuals who seek to be trailblazers in and shapers of the rapidly evolving cybersecurity landscape. At VicOne , a prospective subsidiary of Trend Micro, we offer tremendous opportunities that will challenge and equip you to become engineered to do good in whatever path you take. By choosing to be an agent of change, you will be part of an impactful mission that aims to make the world safe for exchanging digital information. About the team Part of what makes Trend Micro a thought leader in cybersecurity is how we strive to keep the digital world informed and equipped with the knowledge to choose the right defenses for the evolving cybersecurity landscape. The Technical Marketing team plays a key role in this facet of the company by bridging in-house experts with a larger audience and building an impressive library of cybersecurity content. As a member of the team, the Web Developer will write code for both front-end and back-end systems. The main responsibilities include developing databases and services for functionality, as well as creating user interactions on various websites and platforms. What you’ll do: Collect and assess user requirements in collaboration with project manager and UI designer Managing the entire web development process from start to deployment Develop and maintain codes using .NET (C#, ASP.NET) and Javascript framework Overseeing the automated testing and providing feedback to management during the development process Modify and test changes to previously developed applications What you need: At least two years of experience with.NET, C#, [website] MVC framework, and.NET web APIs is required. Experience with JQuery, Bootstrap and new JavaScript frameworks, Angular is plus Skills on Database design, table, views creation, MSSQL server, writing SQL scripts, stored procedures, and optimizing queries. Should be able to work with different rest APIs Good problem solving and analytical skills Good time-management skills A college degree, preferably in Computer Science or any relevant field What will help Great interest and proficiency in cybersecurity the Web, and surrounding technologies Project management experience with coordination skills is a plus Working at Trend Micro: Trend Micro’s core values are customer, change, collaboration, innovation, and trustworthiness. These values define who we want to be and are the foundation of everything we do. They are deeply rooted in our heritage and diversified culture. Trend Micro continues grow from the ever-changing technological world. Therefore, opportunities to learn, hone your creative skills, deepen your technical knowledge, and work with people from all over the world are abundant in the company. In-house experts are always willing to share their knowledge in order to create future cybersecurity experts ready to help customers and make a secure digital landscape. Be Passionate. Be Innovative. Be a Trender. Be #EngineeredToDoGood. We’re a global cybersecurity leader, helping to make the world safe for exchanging digital information. Fueled by decades of security expertise, global threat research, and continuous innovation, our cybersecurity platform protects hundreds of thousands of organizations and millions of individuals across clouds, networks, devices, and endpoints. As a leader in cloud and enterprise cybersecurity, our platform delivers a powerful range of advanced threat defense techniques optimized for environments like AWS, Microsoft, and Google, and central visibility for better, faster detection and response. Our global threat research team delivers unparalleled intelligence and insights that power our cybersecurity platform and help protect organizations around the world from 100s of millions of threats daily. We have 7,000 employees across 65 countries, singularly focused on security and passionate about making the world a safer and better place. We enable organizations to simplify and secure their connected world. Trend Micro’s “Trenders” are passionate about doing the right thing to make the world a safer and better place."
  },
  {
    "job_title": "Associate Software Engineer | Application Developer | Entry Level",
    "company": "Accenture",
    "location": ["National Capital Reg", "Calabarzon & Mimaropa"],
    "salary": null,
    "Prog_scripting_markup_languages": [],
    "databases": [],
    "frameworks_web_dev": [],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "25-11-2022 12:17:24",
    "career_level": "0-1 yr",
    "qualification": "Bachelor's/College Degree Post Graduate Diploma/Master's Degree Professional License (Passed Board/Bar/Professional License Exam)",
    "years_of_experience": null,
    "job_specializations": "Computer/Information Technology",
    "link": "https://www.jobstreet.com.ph/en/job/associate-software-engineer-%7C-application-developer-%7C-entry-level-12594836?jobId=jobstreet-ph-job-12594836&sectionRank=16&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "Ready to join Accenture’s team of empowered people? We’re looking for candidates with the following skills and experience for this role. Do you fit the profile? If you do, we’d love to hear from you! In adherence to Accenture’s process of Identity Verification, your resume or CV must include your photo to ensure the accuracy of your application. Responsibilities: Develop new features or products for an area of our platform working alongside with Development Team Maintain and enhance current features and functionalities and monitor and control the system Configure business processes based on defined business requirements Qualifications: Bachelor’s Degree in Computer Science, Engineering, Mathematics or any Technology/ Programming courses Fresh Graduates are highly encouraged to apply Strong analytical, communication and interpersonal skills Interested in configuring, maintaining and enhancing current features and functionalities of the system Join our high-performing team and enjoy these benefits: Accenture believes that people do their best work when they are their best selves! So, we have innovative programs that help our employees balance a successful career with a healthy lifestyle involving family, friends and the community. Trainings/ Bootcamp/ Knowledge Transfer sessions will be provided before deployment to assigned projects Health Insurance (HMO) & Life Insurance coverage from day 1 of employment Expanded maternity leave up to 120 days* Expanded paternity leave up to 30 days* Employee Stock Purchase Plan Loyalty and Christmas Gift Inclusion and Diversity Benefits Night Differential Allowances Car and Housing Plan* Company-sponsored trainings, upskilling, and certification Flexible Working Arrangements Healthy and Encouraging Work Environment TERMS AND CONDITIONS The company provides an equal opportunity employment and welcomes applications from all sections of society and does not discriminate on grounds of race, religion or belief, ethnic or national origin, disability, age, citizenship, marital, domestic or civil partnership status, sexual orientation, gender identity, or any other basis as protected by applicable law. Additional Information: The following documents will be asked as part of the pre-hiring requirements prior onboarding. We recommend preparing the requirements early to ensure on time boarding. Detailed discussion will take place during onboarding process as well as changes on the requirements as needed. Transcript of Records (TOR) Diploma and/or Certificate of Graduation (for graduates only) NBI Clearance Government Documents: SSS ID and/or SSS Verification Form Pag-IBIG Member’s Data Record (MDR) Philhealth ID and/or Philhealth Member Data Record (MDR) TIN ID and/or Processed BIR Form 1905 or any BIR documents reflecting your TIN and with BIR Stamped COVID-19 update: The safety and well-being of our candidates, our people and their families continues to be a top priority. Until travel restrictions change, interviews will continue to be conducted virtually. Accenture is a global professional services company with leading capabilities in digital, cloud and security. Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Interactive, Technology and Operations services—all powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. Our 514,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities. Visit us at www.accenture.com. Accenture Career Centers* *currently not accepting walk-in applicants Manila GF Cybergate 1 Tower Pioneer, Mandaluyong City Monday to Friday, 8:00 AM to 5:00 PM GF Plaza B Building, Northgate Avenue, North Cyberzone, Filinvest Alabang, Muntinlupa Monday to Friday, 9:00 AM to 5:00 PM Ilocos Valdez Building A, Venvi IT Hub, Barangay 1, San Nicolas, Ilocos Norte Monday to Friday, 9:00 AM to 6:00 PM Cebu 16F Ebloc2, Geonzon Street, Cebu IT Park, Cebu City Monday to Friday, 9:00 AM to 4:00 PM Stay connected Facebook.com/accenturejobsph Twitter.com/accenturejobsph Youtube.com/accenturejobsph Instagram: @accentureph LinkedIn Showcase Page: Accenture Careers in the Philippines Ready to join us? Upload your updated CV to Jobstreet, then click “APPLY NOW.” If you need special assistance because of a disability, please let us know via email at careersPH@accenture.com (Please do not send any CV to this email) Accenture is an equal-opportunity employer . All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law. Job candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process. Accenture is committed to providing veteran employment opportunities to our service men and women."
  },
  {
    "job_title": "Software Developer",
    "company": "Prime Manpower (A ManpowerGroup Affiliate)",
    "location": "Pasig City",
    "salary": null,
    "Prog_scripting_markup_languages": ["SQL"],
    "databases": [],
    "frameworks_web_dev": [],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "25-11-2022 06:17:25",
    "career_level": "1-4 yrs",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": "3 years",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/software-developer-12564298?jobId=jobstreet-ph-job-12564298&sectionRank=17&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "Job Qualifications: At least 3-10 years working experience is required for this position Proven experience as a Fullstack Developer is an advantage Experience in performance tuning/optimizing existing applications Excellent programing skills to develop different kinds of web projects Has basic knowledge in writing the four basic SQL statements and possess a good level of understanding basic relational database concepts Possesses knowledge of various database access methods Job Description: Provides their technical expertise in building a 3-tier web application. Responsible in gathering, analyzing and rendering programming requirements, development and implementation of the product Participates in review sessions and contribute to system testing to ensure quality deliverables Responsible in the development of good quality products in a challenging timeframe Provides regular feedback to management on project status Contributes to the development and continuous review of appropriate practices, standards and guidelines on IT policies, project development and IT related information ManpowerGroup is the world leader in employment services for almost 70 years. Every day, we connect people to meaningful work. Whether you are just a fresh graduate trying to enter the workforce or a professional looking for a career change, we are here to help you navigate the world of work and make the experience better for you. About ManpowerGroup ManpowerGroup (NYSE: MAN) has been the world’s workforce expert, creating innovative workforce solutions, for nearly 70 years. We connect more than 600,000 men and women to meaningful work across a wide range of skills and industries every day. Through our ManpowerGroup family of brands — Manpower, Experis, Right Management and ManpowerGroup Solutions — we help more than 400,000 clients in 80 countries and territories address their critical talent needs, providing comprehensive solutions to resource, manage and develop talent. ManpowerGroup operates in the Philippines through its wholly owned subsidiary Manpower Outsourcing Services Inc. (MOSI) and its local affiliate, Prime Manpower Resources Development, Inc. (Prime Manpower). About Prime Manpower Prime Manpower Resources Development, Inc. (Prime Manpower) is a local affiliate of ManpowerGroup. Prime Manpower provides total recruitment solutions including permanent recruitment, executive search, recruitment process outsourcing, overseas placement, training, and outplacement and career management."
  },
  {
    "job_title": "Jr. Laravel Software Developer  | Las Pinas",
    "company": "Company Confidential",
    "location": "National Capital Reg",
    "salary": null,
    "Prog_scripting_markup_languages": [],
    "databases": [],
    "frameworks_web_dev": ["Laravel"],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "25-11-2022 06:17:26",
    "career_level": "0-1 yr",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": null,
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/jr.-laravel-software-developer-%7C-las-pinas-12546940?jobId=jobstreet-ph-job-12546940&sectionRank=18&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "The Jr. Laravel Software Developer position acts as an employee champion in the organization focused on developing both client and server software thru advance programming. Responsibilities : Develops both front and back-end web applications. Designs UI/UX on web applications. Conceptualizes and advances IT projects to finished product. Designs and develops APIs (Expose and Consume). Meets and ensures technical and user needs. Keeps abreast of developments in web applications and programming languages. Performs other related tasks as determined by immediate superior. Requirements : Knowledge of the said technology/technologies. Less than 1 programming experience. Knowledge in software development life-cycle. The desire to in a fast-paced environment. Ability to learn new software and technologies quickly. Ability to follow instructions and in a team environment. The was established by the MBVillar Group of Companies to complete the components of its Death Care Development. Established and founded on strength and stability, the designed its various life plans to deliver the most value for its client’s hard-earned money. The believes that protection from any uncertainties in life is a must, thus it drives its avidity to help clients achieve the best quality of service and a worry-free future. The envisions to pave its name in this fast-paced industry and to transcend from the customary practice, whilst being of great assistance to the clients as its top priority."
  },
  {
    "job_title": "Software Engineer",
    "company": "Red Asia Inc.",
    "location": ["Central Luzon", "National Capital Reg"],
    "salary": null,
    "Prog_scripting_markup_languages": [
      "JavaScript",
      "Python",
      "TypeScript",
      "Java",
      "C#"
    ],
    "databases": ["NoSQL"],
    "frameworks_web_dev": [
      "Django",
      "Vue",
      "Angular",
      "Flask",
      "React",
      "Ember"
    ],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": ["Known"],
    "CRM_tools": [],
    "methodologies": ["Agile", "Agile development", "DevOps"],
    "cloud_platforms": ["AWS"],
    "version_control_platforms": ["AWS"],
    "date_posted": "25-11-2022 08:17:27",
    "career_level": "1-4 yrs",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": "4 years",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/software-engineer-12593689?jobId=jobstreet-ph-job-12593689&sectionRank=19&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "The environment ENGIE Impact aims to deliver worldwide engineering solutions addressing the needs of our clients regarding energy, urban and water challenges moving towards a sustainable and decarbonised world. Within our Tractebel RED entity based in the Philippines, our DevOps team develops Engineering Tools As a Service in close cooperation with other multi-disciplinary teams that bring expertise in optimisation, simulation, machine learning, AI, etc. Function: Participate in projects within the energy, urban and water domains where technology innovation plays a fundamental role in digital solutions; Work in a fast-paced, agile environment with a team committed to delivering maximum business value to the end customer; Participate in every phase of the software lifecycle, actively contributing to the development at every step Profile: Hold a degree in computer science or related courses with > 4 years experience; Expertise with Python, Java or C# (experience with AWS boto3, Django, Flask or Chalice are a plus); Experience with Cloud technologies and concepts (AWS , Azure,...) Good understanding of relational and NoSQL databases, big data awareness; Good understanding of JavaScript technologies like Node.js, Typescript, and modern JavaScript frameworks (React, Ember, Angular, Vue JS, Knockout) is an advantage; Experience in object-oriented design patterns, principles and concepts is a must; Good knowledge of unit and integration testing techniques; Fluent in English; Fluent with Agile development practices and methodologies (Scrum, Kanban, TDD, BDD); Experience in the energy/utilities sector is an advantage; Strong communication skills, able to work with remote teams; Self-motivated, team player, autonomous; Our offer: A working environment which is an active player in the energy transition and encourages innovation; Challenging and exciting international projects in a dynamic team of high-level experts; A stable, full-time position in an internationally reputed company with room for personal and professional development via the ENGIE University; A competitive compensation package with fringe benefits. Environment and benefits: Friendly work environment 5 -day work, Monday to Friday – Flexible Time Top compensation based on experience 15 Vacation Leave and 10 Sick Leave HMO coverage (medical and dental) from day 1 of employment Career growth and promotion opportunities Competitive salary package and annual performance bonus Pension benefits RED ENGINEERING is a multi-award winning building services practice delivering MEP engineering design services globally, with a focus on local delivery. Red is a recognised authority in producing low carbon, sustainable M&E designs which are commercially feasible, robust and highly attractive. Red is known throughout the industry for challenging conventional design approaches and has created alternative design strategies that reduce both initial and operational costs resulting in lower carbon emissions. Red Asia, Inc. is Red Engineering’s design office, delivering high quality engineering designs made possible by maximizing local talents with global expertise. In the Philippines, Red has been around since 2006, with a high-quality design production office in Makati City, the country’s premier central business district. LOCAL TALENTS, GLOBAL EXPERTISE Excellent design service is attributed to Red’s “...clear vision of what constitutes good service and how excellent performance will be delivered by focusing on the basics – allocating sufficient, talented people to projects and providing them with enough support and time to deliver the service required...”"
  },
  {
    "job_title": "Software Developer (C#)",
    "company": "AMADEUS MARKETING PHILS, INC.",
    "location": "Taguig City",
    "salary": "₱30,000 - ₱40,000",
    "Prog_scripting_markup_languages": ["SQL", "C#"],
    "databases": ["SQL Server"],
    "frameworks_web_dev": ["Angular", "React"],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [".NET"],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": ["Agile"],
    "cloud_platforms": ["AWS"],
    "version_control_platforms": ["Azure", "AWS"],
    "date_posted": "22-11-2022 00:00:00",
    "career_level": "1-4 yrs",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": "1 year",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/software-developer-c-12585318?jobId=jobstreet-ph-job-12585318&sectionRank=20&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "Navitaire, a wholly owned Amadeus Company, delivers industry-leading technology services supporting growth, profitability and innovation to airlines and rail clients worldwide, including many of the world’s most successful airlines. Navitaire offers a full suite of proven solutions focused on revenue generation and streamlining costs in the areas of reservations, ancillary sales, loyalty, revenue management, revenue accounting and business intelligence. Each day, more than 500 employees based in five global offices develop, support and operate Navitaire solutions to help our clients continue to move the travel industry forward In this role, you will: Build expertise on assigned functionalities Build expertise on relevant technologies Follow workload prioritization and provide status updates Analyze requirements. Propose solution, code and automate testing of solutions Resolve production issues Offer flexibility to meet sprint goals Qualifications: BS in Computer Science/Mathematics/Physics/Data Science or equivalent experience Recent college graduates with software development internship experience are welcome to apply 1-2 years development experience working with a company practicing Agile software development practices. Strong verbal and written communication skills Strong analytical skills Ability to work in a dynamic, fast-paced and multi-cultural environment Team player, high initiative and quick learner Technologies we use: Baseline C# / .NET programming experience SQL experience (SQL Server) API integration / implementation experience Able to write unit tests Plus Test automation experience using xUnit, NUnit or other C# test automation framework Experience with implementing cloud deployed solutions (Azure preferred, AWS considered) Web development experience with Angular or React Hands-on experience working within microservice based architecture External API design / implementation experience Cloud data storage experience (Azure SQL, Cosmos or equivalents) Experience working with CI/CD automation Test automation development experience beyond unit testing (integration, performance, etc) Amadeus provides the technology which keeps the travel sector moving - from initial search to making a booking, from pricing to ticketing, from managing reservations to managing check-in and departure processes. Our products and solutions help to improve the business performance of our customers; travel agencies, corporations, airlines, ground handlers, hotels, railways, car rental companies, airports, cruise lines and ferry operators. At the heart of our approach is innovation. Amadeus was recognised in December 2014 as the leading European investor in R&D for the travel and tourism sector by the EU Industrial R&D Investment Scoreboard, which ranks European companies by total investment in R&D. Between 2004 and 2013 Amadeus invested close to €3 billion in R&D. It is this strong commitment that we believe will enable us to continue working with our customers and partners to shape the future of travel. Amadeus operates in 195 countries with a worldwide team of more than 14,000 people. Amadeus is listed on the Spanish Stock Exchange and forms part of the IBEX 35 Index."
  },
  {
    "job_title": "*Software Engineer",
    "company": "ConnectOS",
    "location": "Mandaluyong City",
    "salary": null,
    "Prog_scripting_markup_languages": [],
    "databases": [],
    "frameworks_web_dev": [],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": ["Agile", "Rapid"],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "25-11-2022 06:17:29",
    "career_level": "1-4 yrs",
    "qualification": "Not Specified",
    "years_of_experience": "4 years",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/*software-engineer-12546112?jobId=jobstreet-ph-job-12546112&sectionRank=21&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "Why Join Us? Are you looking for a role that provides opportunities to develop and grow? Take the next step in your career journey with us! We’ll provide you with a professional support structure and benefits to ensure you can thrive. We offer Premium HMO, awesome technology, and above-market remuneration. Our high performers are frequently invited to visit their colleagues internationally for professional development. We’re always searching for great talent to join our team. If you’d like be part of a fast-growing industry leader with an exceptional company culture, we’d love to hear from you: We provide technology infrastructure and services to deliver the full range of financial services including mortgages, asset finance, insurances and financial planning across Australia and New Zealand. Our operational focus is to provide efficient enabling technology, managing information strategically, and expanding and improving our service delivery. We are agile and fast moving and yet we have the benefits of working in a larger organization with the resources and financial ballast for innovation and the opportunity to work on large scale, complex systems This role is responsible for development and maintenance of software application. In particular: Software development Production operations Software and cloud infrastructure improvement and maintenance Technical support Rapid prototyping Product design As an Engineer, your core role is to assist the Engineering Manager to deliver quality, timely solutions within a collaborative team. Duties and Responsibilities: Develop higher-order, SaaS-like software modules for consumption by franchisees, customers and third parties Refine live software products based on performance metrics and customer feedback. Participate in the technical decisions made and implemented across all products created by the team. Contribute to a technology ecosystem of in-house software, purchased products and 3rd-party integrations. Provide technical support to the customers and customer-facing corporate staff that use our software. Proactively learn new skills and technology that can advance product development within the team. Bring your curiosity and we will give you freedom, influence and responsibility Requirements Academic qualifications preferred, not essential - Bachelor in Computer Science, Computer Engineering or similar. Experience developing web-based software in a team environment Curious Autonomous Strong communicator Understands software is a team sport Interested in the business models of software products, not just the technical challenges of programming Standard Job Benefits: HMO on Day 1 Temporary Work from Home Set Up Paid Time-Off Quarterly Sick-Leave conversion Paid Government-Mandated Benefits (SSS, PHIC, Pag-IBIG) Equipment provided Standard Job Highlights: Work-life balance Career growth and development opportunities Stable organization and industry leader Collaborative and fruitful company culture Apply for this job ConnectOS is a leading provider of offshore talent for organisations in Australia, New Zealand, the US, Canada and the UK. For over a decade, we’ve been supporting our global clients with premium resourcing and productivity solutions. ConnectOS is one of the fastest-growing offshoring companies in the world. Founded by our Australian CEO, we help companies across a range of industries activate their capability strategies and optimise their business operations with smarter ways to solve resourcing challenges. Our vibrant, modern work environments achieve high levels of employee engagement: happy, healthy, committed people who love what they do. ConnectOS Team HQ is located at Mega Tower, EDSA in the heart of Manila, Philippines. Our Client Support HQ is based in Melbourne, Australia."
  },
  {
    "job_title": "Programmer",
    "company": "TDCX",
    "location": "National Capital Reg",
    "salary": "₱22,000 - ₱26,000",
    "Prog_scripting_markup_languages": ["JavaScript", "CSS", "C#", "Crystal"],
    "databases": [],
    "frameworks_web_dev": [],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [".NET"],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "25-11-2022 06:17:30",
    "career_level": "1-4 yrs",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": "1 year",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/programmer-12550398?jobId=jobstreet-ph-job-12550398&sectionRank=22&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "#BeMore! Do you aspire for a rewarding career that lets you do more and achieve more? Unleash your full potential at work with TDCX, an award-winning and fast-growing BPO company. Work with the world’s most loved brands and be with awesome, diverse people. Be home, belong, and start your journey to #BeMore! Top reasons to work with TDCX Competitive remuneration, great perks, and performance incentives Comprehensive medical, insurance, or social security coverage Premium workspaces Engaging activities and recognition programs Strong learning and development plans for your career growth Positive culture for you to #BeMore at work Easy to locate area with direct access to public transport Flexible working arrangements Be coached and mentored by experts in your field Join a global company with 26 years of experience and more than 350+ industry awards What is your mission? To lead in new software development initiatives and support existing applications enhancement To work closely with the Manager to consult and improve system Deliver coding, testing and implementing solutions in a Microsoft platform To conduct R&D on emerging Internet Technologies Undertake minor modification to enhance the functionality of current applications To provide 1st level application support to existing business applications. Any other duties and responsibilities that may be assigned to you by the management from time to time, within your category of employment in the organization and for the effective implementation, maintenance and continual improvement of the Quality Management System of TDCX. Who are we looking for? Candidate must possess at least Diploma, Advanced Diploma or Bachelor's Degree in Information Technology or equivalent Minimum 1-2 years of experience as an Application Developer/Software Engineer, preferably from a software development house. Strong understanding and interest in Internet technologies Experience in one or more of the following skills: Microsoft .Net 3.5/4.0 Framework as well as ASP .Net, C#, and web scripting such as Javascript, CSS, XML, Crystal reports Who is TDCX? TDCX (NYSE: TDCX) provides transformative digital CX solutions, enabling world-leading and disruptive brands to acquire new customers, build customer loyalty, and protect their online communities. TDCX helps clients, including many of the world’s best brands, achieve their customer experience aspirations by harnessing technology, human intelligence, and our global footprint. We serve clients in fintech, gaming, technology, home sharing and travel, digital advertising and social media, streaming, and e-commerce. Our expertise and strong footprint in Asia have made us a trusted partner for clients, particularly high-growth, new economy companies looking to tap the region’s growth potential. We pride ourselves on discovering and employing the best professionals to join us as we transform the outsourced CX industry. Our commitment to #BeMore for our people, our clients, and our community has led to us winning several hundreds of industry awards, including being one of the best companies to work for in Asia. From our first-rate workspaces, above-industry-average compensation packages, career opportunities, to our workplace perks, find out what else is in store when you embark on a career with TDCX."
  },
  {
    "job_title": "Software Developer (C#)",
    "company": "AMADEUS MARKETING PHILS, INC.",
    "location": "National Capital Reg",
    "salary": "₱30,000 - ₱35,000",
    "Prog_scripting_markup_languages": ["SQL", "C#"],
    "databases": ["SQL Server"],
    "frameworks_web_dev": ["Angular", "React"],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [".NET"],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": ["Agile"],
    "cloud_platforms": ["AWS"],
    "version_control_platforms": ["Azure", "AWS"],
    "date_posted": "23-11-2022 00:00:00",
    "career_level": "1-4 yrs",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": "1 year",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/software-developer-c-12542361?jobId=jobstreet-ph-job-12542361&sectionRank=23&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "Navitaire, a wholly owned Amadeus Company, delivers industry-leading technology services supporting growth, profitability and innovation to airlines and rail clients worldwide, including many of the world’s most successful airlines. Navitaire offers a full suite of proven solutions focused on revenue generation and streamlining costs in the areas of reservations, ancillary sales, loyalty, revenue management, revenue accounting and business intelligence. Each day, more than 500 employees based in five global offices develop, support and operate Navitaire solutions to help our clients continue to move the travel industry forward In this role, you will: Build expertise on assigned functionalities Build expertise on relevant technologies Follow workload prioritization and provide status updates Analyze requirements. Propose solution, code and automate testing of solutions Resolve production issues Offer flexibility to meet sprint goals Qualifications: BS in Computer Science/Mathematics/Physics/Data Science or equivalent experience Recent college graduates with software development internship experience are welcome to apply 1-2 years development experience working with a company practicing Agile software development practices. Strong verbal and written communication skills Strong analytical skills Ability to work in a dynamic, fast-paced and multi-cultural environment Team player, high initiative and quick learner Technologies we use: Baseline C# / .NET programming experience SQL experience (SQL Server) API integration / implementation experience Able to write unit tests Plus Test automation experience using xUnit, NUnit or other C# test automation framework Experience with implementing cloud deployed solutions (Azure preferred, AWS considered) Web development experience with Angular or React Hands-on experience working within microservice based architecture External API design / implementation experience Cloud data storage experience (Azure SQL, Cosmos or equivalents) Experience working with CI/CD automation Test automation development experience beyond unit testing (integration, performance, etc) Amadeus provides the technology which keeps the travel sector moving - from initial search to making a booking, from pricing to ticketing, from managing reservations to managing check-in and departure processes. Our products and solutions help to improve the business performance of our customers; travel agencies, corporations, airlines, ground handlers, hotels, railways, car rental companies, airports, cruise lines and ferry operators. At the heart of our approach is innovation. Amadeus was recognised in December 2014 as the leading European investor in R&D for the travel and tourism sector by the EU Industrial R&D Investment Scoreboard, which ranks European companies by total investment in R&D. Between 2004 and 2013 Amadeus invested close to €3 billion in R&D. It is this strong commitment that we believe will enable us to continue working with our customers and partners to shape the future of travel. Amadeus operates in 195 countries with a worldwide team of more than 14,000 people. Amadeus is listed on the Spanish Stock Exchange and forms part of the IBEX 35 Index."
  },
  {
    "job_title": "Programmer Trainee",
    "company": "Quadrant Information Services, Inc.",
    "location": "Makati City",
    "salary": null,
    "Prog_scripting_markup_languages": ["C#", "C++"],
    "databases": [],
    "frameworks_web_dev": [],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": ["Windows"],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "25-11-2022 15:17:32",
    "career_level": "0-1 yr",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": null,
    "job_specializations": "Computer/Information Technology",
    "link": "https://www.jobstreet.com.ph/en/job/programmer-trainee-12595847?jobId=jobstreet-ph-job-12595847&sectionRank=24&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "QUALIFICATION A Bachelor of Science degree holder in IT/Computer Science/Computer Engineering or equivalent. - Have developed and very familiar with the Windows operating system (windows 10) - Excellent written and verbal communication skills in English. - Excellent programming logic skills - Team player, hardworking, trustworthy. - Able to work independently in a fast paced environment. - Organized, responsible, can function well under pressure and can handle multiple task - Knowledge in VB, C++, C# is a definite plus. - Excellent time management - Fresh graduates are welcome to apply. Quadrant Information Services, Inc. a Philippine based corporation engaged in Management of Information Systems technicians and encoders. We support own us clients with quality services handling work in connection with United States personal lines property and casualty insurance rating and information management systems and planning services."
  },
  {
    "job_title": "Software Developer (Mid-Level)",
    "company": "GAITCON, INC.",
    "location": "Pasig City",
    "salary": null,
    "Prog_scripting_markup_languages": ["SQL", "Java", "C#"],
    "databases": ["SQL Server"],
    "frameworks_web_dev": ["ASP.NET", "Reactjs"],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [".NET"],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "20-11-2022 00:00:00",
    "career_level": "1-4 yrs",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": "3 years",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/software-developer-mid-level-12555921?jobId=jobstreet-ph-job-12555921&sectionRank=25&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "Bachelor's degree in Computer Science / Diploma in a related field or equivalent work experience Amenable to working in shifting schedule Minimum of 3 years of design and development experience with NodeJS , ReactJS , and Java Understanding of software development lifecycle and best practices Understanding of database design and development Understanding and experience working with common development design patterns and architectural patterns Good understanding of web application design principles and Classic ASP design patterns Strong understanding of the ASP Page life cycle - Demonstrated ability to translate business requirements to technical design and specifications Ability to engage in executive and senior-level technology discussions Attention to detail and ability to work productively with limited supervision Ability to deal with changing priorities and deadlines Excellent English verbal and written communication skills Exceptional interpersonal skills Advanced analytical, problem-solving, and conceptual skills GAITCON INC. helps clients optimize business opportunities by leveraging on technology and systems that help facilitate business. As an IT consulting firm, we offer end-to end solutions, from concept, to design, to implementation, and support. Gaitcon applies its knowledge in designing and building packages for companies in different industries. We work closely with our clients to align vision and objectives, detail out requirements and ensure a system that best suits the organization or company in need of it. The team has extensive experience in the Microsoft Platform, including .NET, C#, VB.NET, ASP.NET, SQL Server, and other platforms that your business may require. We follow a robust process and time proven development to deliver a quality product for our satisfied users. Based in the U.S. and in the Philippines, our teams are composed of highly experienced, top quality IT professionals who have worked for Fortune 100 companies across several industries such as Financial Services, BPO/Call Center, and Travel. With our technical know-how and experience with U.S. clients, we are able to provide high quality IT solutions at competitive rates and customized services for clients who expect personalized attention, focus, speed and efficiency."
  },
  {
    "job_title": "Software Engineers",
    "company": "MTI Advanced Test Development Corp.",
    "location": "National Capital Reg",
    "salary": null,
    "Prog_scripting_markup_languages": [
      "JavaScript",
      "HTML",
      "CSS",
      "SQL",
      "C#",
      "VBA"
    ],
    "databases": [],
    "frameworks_web_dev": ["jQuery", "ASP.NET", "ASP.NET MVC", "Foundation"],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [".NET"],
    "other_tools": ["Object Oriented Programming", "Flow"],
    "IDLE": ["Visual Studio"],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": ["Windows"],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": ["Agile"],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "25-11-2022 06:17:35",
    "career_level": "1-4 yrs",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": "4 years",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/software-engineers-12549265?jobId=jobstreet-ph-job-12549265&sectionRank=26&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "Software Development and Platform integration/Upgrade support for the Manufacturing Execution System used by Front End Manufacturing at Microchip’s USA facilities. The candidate will work closely with Philippines-based teammates and collaborating with counterparts in USA while reporting to a Philippines based Site IT Manager. The candidate will participate in and/or coordinate tasks involved in a software development life cycle: Analysis, Design, Development, Testing, Implementation, and Post-Implementation/Integration or Upgrade Support. Essential Competencies: Knowledge with either Frontend or Backend Manufacturing is an advantage. Understand user requirements and complex manufacturing topics. Working knowledge with process flow and data flow diagramming and other analysis tools is an advantage Have strong analytical and problem solving skills. Strong communication skills. Collaborate with US, Thailand and Philippines based software developers; Ability to work independently and in a team to develop innovative solutions. Flexible to adapt to the dynamics of software support or development work. Follow the Microchip Information Systems policies and procedures on development, project management, and change control. Flexibility to travel as required. Understanding of Agile Software Development methodology. JOB REQUIREMENTS: Candidate must have a Computer Science BS Degree or equivalent, be self-driven, and have 4-6+ years of experience in .NET development and relational databases. Skills required: C#, ASP.NET, MVC, HTML, JavaScript, VBA, Object Oriented Programming and Design Methodologies, SQL, Stored Procedures, Relational Database Structure, and other Data modeling concepts, Windows Operating System, Visual Studio Team Foundation System. Other skills preferred: Service Oriented Architecture and Design, JSON, JQuery, Ajax, SignalR, CSS, Visual Studio 2010 or later versions (Visual Studio 2019 preferably. Microchip Technology Inc. is a leading provider of smart, connected and secure embedded control solutions. Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs which reduce risk while lowering total system cost and time to market. The company’s solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets. Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality. ·      Founded in 1989 ·      Publicly held (NASDAQ: MCHP) and listed on the Standard & Poor’s 500 financial index ·      $1.326 billionin GAAP net sales in fourth quarter of fiscal year 2020 (ending March 31, 2020) ·      Approximately 18,000 employees worldwide ·      63 sales offices worldwide ·      Manufacturing facilities: Tuscaloosa, AL; Tempe, AZ; Santa Clara, CA; Garden Grove, CA; Boulder, CO; Colorado Springs, CO; Simsbury, CT; Lowell, MA; Lawrence, MA; Beverly, MA; Gresham, OR; Mount Holly Springs, PA; Teltow, Germany; Neckarbischofsheim, Germany; Laguna, Philippines; Manila, Philippines; Bangkok, Thailand; Caldicot, UK ·      Development centers: Bangalore, India; Lausanne, Switzerland; Santa Clara & Los Angeles, CA; Chandler, AZ; Bucharest, Romania; Manila, Philippines; Budapest, Hungary; Norristown, PA; Shanghai, China; Hsinchu, Taiwan; Austin, TX; Karlsruhe, Germany; Gothenburg, Sweden; Hauppauge, NY; Chennai, India; Irvine, CA; Hong Kong, China; Vietnam; Nantes, France; Rousset, France; Heilbronn, Germany; Whiteley, UK; Trondheim, Norway ·      The Company’s quality systems are ISO/TS-16949:2009certified ·      118 consecutive quarters (more than 29 years) of profitability as of March 31, 2020 ·      Shipped more than 25 billion microcontrollers ·      #1 in worldwide 8-bit microcontroller revenue and #3 in worldwide microcontroller revenue    according to Gartner ·      Corporate headquarters: 2355 W. Chandler Blvd., Chandler, AZ 85224, United States Applications Microchip serves over 120,000 customers in more than 65 countries who are designing high-volume embedded control applications in the consumer, automotive, industrial, communications and aerospace and defense industries.\n\t\t\n\t\tProduct Summary Microchip has an extensive product portfolio including: ·      Microcontrollers and Microprocessors ·      FPGAs ·      Analog ·      Interface and Connectivity ·      Power Management ·      Memory ·      Clock and Timing ·      Embedded Controllers and Super I/O ·      Switches and Controllers ·      High-Speed Networking and Video ·      Wireless Connectivity ·      High-Reliability Discretes ·      Security ICs ·      Touch and Gesture ·      Enterprise Storage"
  },
  {
    "job_title": "IT Software Developer Associate - Mandaluyong",
    "company": "Corporate Technologies, Inc. (CTI)",
    "location": "Mandaluyong City",
    "salary": null,
    "Prog_scripting_markup_languages": ["SQL", "C#"],
    "databases": ["SQL Server", "MS SQL Server"],
    "frameworks_web_dev": [],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [".NET"],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": ["Agile"],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "23-11-2022 00:00:00",
    "career_level": "1-4 yrs",
    "qualification": "Not Specified",
    "years_of_experience": "1 year",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/it-software-developer-associate-mandaluyong-12559826?jobId=jobstreet-ph-job-12559826&sectionRank=27&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "JOB SUMMARY: The Associate, IT Software Developer is responsible for delivering quality software development and maintenance services in accordance with the CTI Software Development Life Cycle standard. Performs simple to minor programming work under the direction of the Lead, SW Developer or the Lead or IT Solutions Architect DUTIES AND RESPONSIBILITIES: Application Development & Maintenance Develops, maintains and provides up to 2nd level technical support for IT applications, packages and IT. Works with management, IT team and customers in understanding application’s technical requirements, determining scope and delivering high quality application systems and services on time. Application Deployment and Support Provide technical support to all applications and resolve issues · Administer all upcoming plug-ins, new service packs and versions and ensure effective implementation to provide better services. Administer all implementation issues and generate short-term resolution, as well as long term preventive measures for development Works closely with the supervisor for clear and efficient problem identification, analysis and solutions formulation or work-around. Quality Assurance and Compliance Delivers quality software and services that has passed through agreed Quality Assurance processes for compliance with expectations and continuous improvements EDUCATIONAL BACKGROUND: Bachelor’s degree in Information Technology or related discipline required WORK EXPERIENCE: Minimum 1-year experience in software development, deployment and integration, and computer systems validation. Minimum 1-year experience in Microsoft Environment Minimum one (1) year in backend and database software design and development Minimum one (1) year in front-end software design and development Minimum one (1) year in application maintenance and support Minimum one (1) years in Open Source technology environment as front-end, back-end and database design and development is a plus Minimum one (1) years in Mobile environment development is a plus Real Estate, Hospitality, Tenancy and Leasing and Property Management and Retail experience is a strong plus. Has an experience in program languages of C# and .NET TRAININGS ACQUIRED: SDLC, ITIL, IT Project Management, Agile Design and Development, MS Sql Server 2003 to latest; Visual Studio; /2008/2012/2015 Corporate Technologies, Inc. (CTI) was incorporated in 1997 to service all the IT Support requirements of Filinvest Land Inc. (FLI), Filinvest Alabang Inc. (FAI), Filinvest Supermall Inc. (FSI) and Filinvest Development Corporation (FDC). Since 2018, CTI has evolved from a small IT department and has become a separate business unit offering end-to-end IT services for the entire Filinvest Group. CTIs primary purpose is to establish, maintain, operate and provide computer services and information and communication technology services, including but not limited to, value-added services, general consulting, information systems planning, network and systems implementation, development and integration, business re-engineering services, systems integration and systems development, application development, quality assurance, and purchase and sale of hardware equipment and software licenses."
  },
  {
    "job_title": "Software Engineer / .Net Developer | Day shift | Makati City | FULL ONSITE",
    "company": "Nezda Technologies, Inc.",
    "location": "National Capital Reg",
    "salary": "₱50,000 - ₱100,000",
    "Prog_scripting_markup_languages": ["JavaScript", "CSS", "SQL", "C#"],
    "databases": ["SQL Server", "MS SQL Server"],
    "frameworks_web_dev": ["ASP.NET", "ASP.NET MVC", "React"],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [],
    "other_tools": ["Terraform"],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": ["Sharepoint"],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "25-11-2022 06:17:36",
    "career_level": "0-1 yr",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": "5 years",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/software-engineer-.net-developer-%7C-day-shift-%7C-makati-city-%7C-full-onsite-12563744?jobId=jobstreet-ph-job-12563744&sectionRank=28&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "To demonstrate accountability and ownership for all the mentioned key accountability areas, with pride in providing timely and high-quality deliverables. Design, develop (mainly PoC), review, and modify software systems, using technical analysis and process models to predict and measure outcomes and consequences of design. Analyzes user needs and software requirements to determine the feasibility of design within time and cost constraints. Participate in end-to-end Application Development and Support/Maintenance activities. Support PM and team in implementing continuous improvements, to ensure application stability and performance to minimize support calls and service disruptions. Qualifications: Minimum (5) years of professional design and coding experience. Proficient in C#, ASP.Net (MVC, Web Forms, Web API). Proficient in JavaScript / jQuery. CSS / HTML. Proficient in MS SQL Server DB Scripting: TSQL, Indexes, and Performance Optimization. Experience with a high volume of data processing is a plus. Proficient in Stored Procedures, User Defined Functions, and Views. Experience in Git repository. Knowledge in SharePoint Development (SPFX / React UI) is a plus. Experience in Terraform is a plus. Nezda - Established in 2014 with 2 offices world-wide, 200+ global clients and strategic workforce is now emerging as Philippines’s most promising people supply chain company with multiple offices and 300+ core employees. The company started with IT Temporary staffing and now expanded its portfolio to now become the one stop solution for staffing & HR services by offering the following services:-Temporary staffing, Permanent Recruitment, Payroll processing, and Learning Services."
  },
  {
    "job_title": "Senior Software Application Developer (.Net Developer)",
    "company": "Asia Select Inc.",
    "location": "Taguig City",
    "salary": "₱100,000 - ₱120,000",
    "Prog_scripting_markup_languages": ["SQL"],
    "databases": [],
    "frameworks_web_dev": [],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [".NET"],
    "other_tools": ["Flow"],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "23-11-2022 00:00:00",
    "career_level": "1-4 yrs",
    "qualification": "Bachelor's/College Degree",
    "years_of_experience": "4 years",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/senior-software-application-developer-.net-developer-12587512?jobId=jobstreet-ph-job-12587512&sectionRank=29&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "Senior Software Application Developer (.Net Developer) The Senior Software Application Developer will develop information systems by designing, developing and installing software solutions. He/she will also decode software requirements into robust programming code. KEY RESPONSIBILITIES: Determines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions Documents and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code Mentor or lead other Software Application Developers in delivering solutions or completing assignments Consults with the project team to create viable solutions including design, development and testing of those solutions put forth Improves operations by conducting systems analysis; recommending changes in policies and procedures Obtains and licenses software by obtaining required information from vendors; recommending purchases; testing and approving products Develops software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas; following the software development lifecycle QUALIFICATIONS & REQUIREMENTS: Bachelor’s degree in Computer Science, Software Engineering, Mathematics, Information Technology, Business Management or related fields At least 4 years of related working experience Technical Certifications or Certifications in Information Systems or Management is a plus Must have solid background knowledge and experience in C#.NET Must have working knowledge and experience in SQL Possesses good communication skills, both written and verbal Work Schedule: Night shift Work Setup: On-site (Taguig) Asia Select Inc. is a human capital solutions firm bringing people and career opportunities together. We specialize in talent attraction and recruitment through our core solutions Executive Search, Contingency Search, Recruitment Process Outsourcing (RPO), HR Consultancy, and Learning and Development. At Asia Select, we bring people and career opportunities together. We are the industry thought leaders who continue to value our clients and deliver quality results. Attracting and hiring right-fit individuals are critical to an organization due to the evolution of the recruitment landscape over the past years. Acquiring and retaining quality candidates have been far more complex due to the competitive job market. Companies need strategic approaches to manage and leverage talent supply chains to drive the success of their businesses. We understand the complexity of the talent landscape and have mastered the science of Talent Acquisition. As the industry leader, it is our expertise to help organizations succeed through our holistic approach to overcoming recruitment challenges."
  },
  {
    "job_title": ".Net Developer - Software Dev",
    "company": "Indra Philippines, Inc.",
    "location": "Pasig City",
    "salary": null,
    "Prog_scripting_markup_languages": ["C++"],
    "databases": [],
    "frameworks_web_dev": [],
    "frameworks_mobile_dev": [],
    "other_frameworks_and_libraries": [".NET"],
    "other_tools": [],
    "IDLE": [],
    "asynchronous_tools": [],
    "synchronous_tools": [],
    "OS": [],
    "CMS_tools": [],
    "CRM_tools": [],
    "methodologies": [],
    "cloud_platforms": [],
    "version_control_platforms": [],
    "date_posted": "22-11-2022 00:00:00",
    "career_level": "1-4 yrs",
    "qualification": "Vocational Diploma/Short Course Certificate Bachelor's/College Degree",
    "years_of_experience": "3 years",
    "job_specializations": ["IT-Software", "Computer/Information Technology"],
    "link": "https://www.jobstreet.com.ph/en/job/.net-developer-software-dev-12538107?jobId=jobstreet-ph-job-12538107&sectionRank=30&token=0~b242d580-2a67-4aa1-bcd3-59d00b5816f2&fr=SRP%20Job%20Listing",
    "summary": "Qualifications: Minimum 3 years of experience with the following: .Net Able to deal directly with the customer. Good communication skills. Responsibilities : - Maintenance of an existing application. Will work for Germany in European time. (Mid Shift) Technical Knowledge: .NET >> C++ .NET (Advanced) VB.Net (Advanced) Experience: 3-4 Years Functional Knowledge: Digital Technologies >> Scrum (Mid) Indra in the Philippines Indra in the Philippines is one of the leading IT services providers in the Philippines and in Southeast Asia. Indra has been operating in the Philippines since 1995, providing a wide range of services across across highly dynamic markets such as Energy and Industry, Telecommunications, Financial Services, and Public Administration. Our parent company, Indra Sistemas, S.A. is headquartered in Madrid, Spain. It is one of the leading global technology and consulting companies and the technological partner for core business operations of its customers world-wide. The multinational is a world leader in providing proprietary solutions in the Transportation, Air Traffic and Defense markets. It is the leading firm in Digital Transformation Consultancy and Information Technologies in Spain and Latin America through its affiliate Minsait. The Philippine office of Indra serves as the Southeast Asian strategic center of the company. We currently manage more than 200 projects, with experience in successful projects in over 15 countries spanning four continents, including Southeast Asian neighbors such as Indonesia, Malaysia, Vietnam, Bangladesh, Thailand. Our business also extend to clients in Spain, the United Kingdom and the United States of America. As a leading IT multinational, our local presence in the Philippines serves as a key strength as it assures our clients that they receive the full range of support throughout the lifecycle of any project engagement. We are comprised of more than 1,200 top-flight IT professionals who have mostly grown within the organization and come from the leading universities in the country. Our consultants have undergone rigorous screening and training programs in order to maintain our level of excellence in providing the utmost in customer service to our clients. The Philippine office is also a global competency center for offshore development projects worldwide through the Indra Software Labs in Manila. Together with 20 other high-performance software development centers around the world, the Indra Software Labs is able to provide nearshore-offshore local development and constant R&D to provide innovative solutions and services to Indra’s clients."
  }
]
